other_files/OpenFOAM_Sample_Files/External CFD/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
(-14.5 -20.0 0.0)
(32.5 -20.0 0.0)
(32.5 185.0 0.0)
(-14.5 185.0 0.0)
(-14.5 -20.0 20.0)
(32.5 -20.0 20.0)
(32.5 185.0 20.0)
(-14.5 185.0 20.0)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (9 41 4 ) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (2 6 5 1)
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //

